import singleBlogImage from "../../../assets/images/singleBlogImage.png";
import blog1 from "../../../assets/images/blog1.png";
import blog2 from "../../../assets/images/blog2.png";
import blog3 from "../../../assets/images/blog3.png";
const SingleBlogGrid = () => {
  const lastBlog = [
    {
      image: blog1,
      title: "لوريم ابسيوم",
      date: "سبتمبر ٢٠٢٣",
      description:
        "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات ",
    },
    {
      image: blog2,
      title: "لوريم ابسيوم",
      date: "سبتمبر ٢٠٢٣",
      description:
        "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات ",
    },
    {
      image: blog3,
      title: "لوريم ابسيوم",
      date: "سبتمبر ٢٠٢٣",
      description:
        "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات ",
    },
  ];
  return (
    <div className="grid grid-cols-12 mt-[2rem] gap-x-[3rem]">
      {/* first column */}
      <div className="col-span-8">
        <div className="flex justify-between">
          <h1 className="font-bold text-[1.6rem] leading-relaxed w-[70%] text-[#333333]">
            وضع حجر الأساس لأكبر مشروع متكامل الإنتاج مركزات النحاس في سلطنة
            عمان
          </h1>
          <p className="text-[#666666] font-normal text-lg">سبتمبر ٢٠٢٣</p>
        </div>
        <p className="text-[#666666] text-md leading-[2rem] mt-2">
          لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو
          أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت
          انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي
          يت أليكيوب أكس أيا كوممودو كونسيكيوات لوريم ايبسوم دولار سيت أميت
          ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور
          أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم
          فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس
          أيا كوممودو كونسيكيوات
        </p>
        <img
          className="w-full h-[27rem] rounded-3xl mt-[1rem] object-cover"
          src={singleBlogImage}
        />
        <h1 className="font-bold text-[1.6rem] mt-[1rem] leading-relaxed w-[70%] text-[#333333]">
          لوريم ايبسوم دولار سيت
        </h1>
        <p className="text-[#666666] text-md leading-[2rem] mt-2">
          لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو
          أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت
          انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي
          يت أليكيوب أكس أيا كوممودو كونسيكيوات لوريم ايبسوم دولار سيت أميت
          ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور
          أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم
          فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس
          أيا كوممودو كونسيكيوات
        </p>
      </div>
      {/* second column */}
      <div className="col-span-4">
        <h1 className="text-[#333333] font-bold text-[1.2rem]">آخر المدونات</h1>
        <div className="w-full h-[0.3rem] mt-2 bg-primary rounded-full"></div>
        {lastBlog?.map((lastBlog) => (
          <div className="mt-[2rem]">
            <img
              className="w-full h-[15rem] object-cover rounded-xl"
              src={lastBlog?.image}
            />
            <div className="flex justify-between mt-2">
              <h1 className="text-xl font-bold text-[#000000]">
                {lastBlog?.title}
              </h1>
              <p className="text-sm text-[#000000] mt-1">{lastBlog?.date}</p>
            </div>
            <p className="text-[#666666] text-sm mt-2 leading-relaxed line-clamp-3">
              {lastBlog?.description}
            </p>
          </div>
        ))}
      </div>
    </div>
  );
};
export default SingleBlogGrid;
